Revit 2024 API
ConicalSurface.YDir Property
 X axis of the local coordinate system associated with this cone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ YDir { get; }
Visual Basic
Public ReadOnly Property YDir As XYZ
	Get
Visual C++
public:
property XYZ^ YDir {
	XYZ^ get ();
}
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace